package school.faang.user_service.dmitrysprint4.facebookcomments;

public class PostService {
    //Хранить список постов в переменной posts. Подумайте, каким ключевым словом можно обозначить переменную posts, чтобы обеспечить согласованный доступ к этим данным из нескольких потоков

    //Содержать метод addPost(Post post), который добавляет пост в список. Используйте блокировку (lock) для обеспечения безопасности данных.

    //Содержать метод addComment(int postId, Comment comment), который добавляет комментарий к посту по его идентификатору. Для обеспечения безопасности данных при добавлении комментариев также используйте блокировку (lock).

    //Реализовать методы для просмотра и удаления постов и комментариев.


}
